# ラベル一覧
ALL_LABELS = {
    "楽しい", "喜び", "欲求",
    "怒り", "躁", "悲しみ", "不安", "無気力", "不快", "鬱", "希死念慮",
    "買い物", "旅行", "友だちと遊んだ", "風呂に入った",
    "風呂に入らなかった", "学校・仕事を休んだ", "不眠", "体調不良",
    "過集中", "衝動買い", "失くし物", "忘れ物", "遅刻"
}

# 5分類
CATEGORY_MAP = {
    "ネガティブな興奮": {"怒り", "躁", "欲求"},
    "ポジティブな興奮": {"楽しい", "喜び", "買い物", "旅行", "友だちと遊んだ",  "風呂に入った"},
    "正常な落ち込み": {"悲しみ", "不安", "無気力", "不快"},
    "異常な落ち込み": {"鬱", "希死念慮", "風呂に入らなかった", "学校・仕事を休んだ", "不眠", "体調不良"},
    "ADHD傾向": {"過集中", "衝動買い", "失くし物", "忘れ物", "遅刻"},
}

# 5分類の色
CATEGORY_COLORS = {
    "ネガティブな興奮": "#ff4545",
    "ポジティブな興奮": "#f97316",
    "正常な落ち込み": "#3b82f6",
    "異常な落ち込み": "#8b5cf6",
    "ADHD傾向": "#30e048",
}

# 5分類の絵文字
CATEGORY_EMOJI = {
    "ネガティブな興奮": "😡",
    "ポジティブな興奮": "🥰",
    "正常な落ち込み": "😢",
    "異常な落ち込み": "🤢",
    "ADHD傾向": "🤯",
}

# ラベルの絵文字
EMOJI_MAP = {
    "怒り": "😡",
    "躁": "😆",
    "過集中": "🎯",
    "衝動買い": "🛒",
    "失くし物": "🔍",
    "忘れ物": "👜",
    "楽しい": "🥳",
    "喜び": "😊",
    "買い物": "🛍️",
    "旅行": "🧳",
    "友だちと遊んだ": "🎉",
    "欲求": "🔥",
    "風呂に入った": "🛁",
    "悲しみ": "😢",
    "不安": "😰",
    "無気力": "😶",
    "不快": "😖",
    "鬱": "🥀",
    "希死念慮": "💀",
    "風呂に入らなかった": "🚫🛁",
    "学校・仕事を休んだ": "🏫🚫",
    "不眠": "🌙",
    "体調不良": "🤒",
    "遅刻": "⏰"
}
