# ラベル一覧
ALL_LABELS = {
    "楽しい", "喜び", "欲求",
    "怒り", "躁", "悲しみ", "不安", "無気力", "不快", "鬱", "希死念慮",
    "買い物", "旅行", "友だちと遊んだ", "風呂に入った",
    "風呂に入らなかった", "学校・仕事を休んだ", "不眠", "体調不良",
    "過集中", "衝動買い", "失くし物", "忘れ物", "遅刻"
}

# 6分類
CATEGORY_MAP = {
    "躁": {"怒り", "躁", "欲求"},
    "喜び": {"楽しい", "喜び", "買い物", "旅行", "友だちと遊んだ",  "風呂に入った"},
    "落ち込み": {"悲しみ", "不安", "無気力", "不快"},
    "鬱": {"鬱", "希死念慮", "学校・仕事を休んだ", "体調不良"},
    "躁鬱傾向": {"風呂に入らなかった", "不眠"},
    "ADHD傾向": {"過集中", "衝動買い", "失くし物", "忘れ物", "遅刻"},
}

# 6分類の色
CATEGORY_COLORS = {
    "躁": "#ff4545",
    "喜び": "#f97316",
    "落ち込み": "#3b82f6",
    "鬱": "#8b5cf6",
    "躁鬱傾向": "#ec4899",
    "ADHD傾向": "#30e048",
}

# 6分類の絵文字
CATEGORY_EMOJI = {
    "躁": "😡",
    "喜び": "🥰",
    "落ち込み": "😢",
    "鬱": "🤢",
    "躁鬱傾向": "🌗",
    "ADHD傾向": "🤯",
}

# グラフでは多いほどマイナス方向に表示するカテゴリ
NEGATIVE_GRAPH_CATEGORIES = {"落ち込み", "鬱"}

# グラフではプラス方向とマイナス方向の両方に表示するカテゴリ
BIDIRECTIONAL_GRAPH_CATEGORIES = {"躁鬱傾向"}

# ラベルの絵文字
EMOJI_MAP = {
    "怒り": "😡",
    "躁": "😆",
    "過集中": "🎯",
    "衝動買い": "🛒",
    "失くし物": "🔍",
    "忘れ物": "👜",
    "楽しい": "🥳",
    "喜び": "😊",
    "買い物": "🛍️",
    "旅行": "🧳",
    "友だちと遊んだ": "🎉",
    "欲求": "🔥",
    "風呂に入った": "🛁",
    "悲しみ": "😢",
    "不安": "😰",
    "無気力": "😶",
    "不快": "😖",
    "鬱": "🥀",
    "希死念慮": "💀",
    "風呂に入らなかった": "🚫🛁",
    "学校・仕事を休んだ": "🏫🚫",
    "不眠": "🌙",
    "体調不良": "🤒",
    "遅刻": "⏰"
}
